lib/api/mpesa/services/xml/checkout/checkoutRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="tns:ns">
    <soapenv:Header>
        <tns:CheckOutHeader>
            <MERCHANT_ID></MERCHANT_ID>
            <REFERENCE_ID></REFERENCE_ID>
            <PASSWORD></PASSWORD>
            <TIMESTAMP></TIMESTAMP>
        </tns:CheckOutHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tns:processCheckOutRequest>
            <MERCHANT_TRANSACTION_ID></MERCHANT_TRANSACTION_ID>
            <REFERENCE_ID></REFERENCE_ID>
            <AMOUNT></AMOUNT>
            <MSISDN></MSISDN>
            <!--Optional:-->
            <ENC_PARAMS></ENC_PARAMS>
            <CALL_BACK_URL></CALL_BACK_URL>
            <CALL_BACK_METHOD></CALL_BACK_METHOD>
            <TIMESTAMP></TIMESTAMP>
        </tns:processCheckOutRequest>
    </soapenv:Body>
</soapenv:Envelope>
